<h1 style="font-size:36px">R data type</h1>

Numeric: This data type includes numbers with decimal places or without decimal places. For example, 3.14 or 2.

Integer: This data type includes whole numbers. For example, 4, 6, 7.

Character: This data type includes text or strings. For example, "Hello", "World".

Logical: This data type includes TRUE and FALSE values.

Date: This data type includes dates in a specific format. For example, "2023-03-02".

Time: This data type includes time in a specific format. For example, "12:30:45".

Factor: This data type includes categorical variables. For example, "Male" or "Female".

Complex: This data type includes complex numbers with real and imaginary parts.

Raw: This data type includes raw bytes of data.

<h1 style="font-size:36px">Python data type</h1>

Integer: Integers are whole numbers, such as 1, 2, 3, etc. In Python, integers are represented by the int data type.

Float: Floats are numbers with decimal points, such as 1.0, 2.5, 3.14, etc. In Python, floats are represented by the float data type.

Boolean: Booleans represent True or False values. In Python, booleans are represented by the bool data type.

String: Strings are sequences of characters, such as "hello", "world", "Python", etc. In Python, strings are represented by the str data type.

List: Lists are ordered collections of elements. The elements can be of any data type, and they can be added, removed, or modified. In Python, lists are represented by the list data type.

Tuple: Tuples are similar to lists, but they are immutable, meaning their elements cannot be changed once they are created. In Python, tuples are represented by the tuple data type.

Dictionary: Dictionaries are unordered collections of key-value pairs. The keys must be unique and immutable, and the values can be of any data type. In Python, dictionaries are represented by the dict data type.

Set: Sets are unordered collections of unique elements. They can be used to perform mathematical set operations such as union, intersection, and difference. In Python, sets are represented by the set data type.

<h1 style="font-size:36px">data structure of R</h1>

Vectors: A vector is a one-dimensional array that can hold data of the same type, such as numbers or characters.

Matrices: A matrix is a two-dimensional array that can hold data of the same type. It is similar to a vector but with rows and columns.

Data frames: A data frame is a two-dimensional table-like structure where each column can contain different types of data. It is commonly used to store data in a spreadsheet format.

Lists: A list is a collection of objects of different types, such as vectors, matrices, or data frames.

Factors: A factor is a vector that contains categorical data, such as levels of a variable.

Arrays: An array is a multidimensional data structure that can hold data of the same type.

Tables: A table is a data structure used for counting and tabulating data. It is often used for frequency tables or contingency tables.

In [41]:
#Vectors
y <- c("apple", "banana", "orange")
#Matrices
x <- matrix(c(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12), nrow=3, ncol=4);x
x[2, 3]
rowMeans(x)
#Data frames
df <- data.frame(
  name = c("John", "Sarah", "Adam", "Lisa"),
  age = c(25, 30, 35, 40),
  gender = c("Male", "Female", "Male", "Female"),
  salary = c(50000, 60000, 70000, 80000)
)
#Lists
x <- list(c(1, 2, 3), c("apple", "banana", "orange"), matrix(1:9, nrow=3))
#Factors
x <- factor(c("red", "green", "blue", "red", "blue", "green"));levels(x)
#Arrays:
x <- array(1:24, dim=c(2, 3, 4))
x[1, 2, 3]
#Tables
x <- c("red", "blue", "green", "red", "red", "green", "blue", "blue", "red")
y <- c("small", "medium", "medium", "large", "small", "medium", "large", "large", "medium")
table(x, y)

     [,1] [,2] [,3] [,4]
[1,] 1    4    7    10
[2,] 2    5    8    11
[3,] 3    6    9    12

[1] 8

[1] 5.5 6.5 7.5

[1] "blue"  "green" "red"

[1] 15

       y
x       large medium small
  blue      2      1     0
  green     0      2     0
  red       1      1     2

<h1 style="font-size:36px">data structure of python</h1>

Lists: A list is a mutable, ordered collection of elements, which can be of any data type.

Tuples: A tuple is an immutable, ordered collection of elements, which can be of any data type.

Sets: A set is an unordered collection of unique elements, which can be of any data type.

Dictionaries: A dictionary is an unordered collection of key-value pairs, which can be of any data type.

Strings: A string is a sequence of characters, which is immutable in Python.

Arrays: An array is a collection of elements of the same data type.

Python also provides specialized data structures for working with specific types of data, such as:

Deques: A deque is a double-ended queue that allows adding and removing elements from both ends efficiently.

Stacks: A stack is a collection of elements that follows the LIFO (Last-In-First-Out) principle.

Queues: A queue is a collection of elements that follows the FIFO (First-In-First-Out) principle.

Heaps: A heap is a tree-based data structure that allows efficient insertion, deletion, and retrieval of the minimum or maximum element.

Heaps:

In Python, a heap is a binary tree data structure that satisfies the heap property: the value of each node is greater than or equal to (in a max-heap) or less than or equal to (in a min-heap) the values of its children.
Heaps are commonly used in algorithms such as heap sort, priority queues, and graph algorithms like Dijkstra's algorithm.

In [4]:
import heapq
data = [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
# convert the list to a max-heap
heapq.heapify(data)
#to add the value 7 to the heap, you can use the heappush()
heapq.heappush(data, 7)
#You can then use the heappop() function to remove and return the top element of the heap:
top_element = heapq.heappop(data)

In [ ]:
Queues

In Python, a queue is a data structure that allows elements to be inserted at one end (the rear) and removed from the other end (the front). The first element inserted is the first to be removed, following the principle of First-In-First-Out (FIFO).

In [7]:
import queue
# create a queue
q = queue.Queue()

q.put(1)
q.put(2)
q.put(3)

x = q.get() # x = 1
y = q.get() # y = 2
z = q.get() # z = 3

stack

In Python, a stack is a data structure that allows elements to be inserted and removed only from one end, called the top of the stack. The last element inserted is the first to be removed, following the principle of Last-In-First-Out (LIFO).

Python provides several built-in modules for implementing stacks, including list and deque. The choice of module depends on the specific application and requirements.

In [8]:
# create an empty stack
stack = []

# push elements onto the stack
stack.append(1)
stack.append(2)
stack.append(3)

# pop elements from the stack
x = stack.pop() # x = 3
y = stack.pop() # y = 2
z = stack.pop() # z = 1

Deques

a deque is a data structure that allows elements to be inserted and removed from both ends of the sequence.
The name "deque" stands for "double-ended queue", and it provides the benefits of both stacks and queues.

In [11]:
from collections import deque
# create an empty deque
d = deque()
d.append(1)
d.append(2)
d.append(3)
d.appendleft(0)
d
x = d.pop() # x = 3
y = d.popleft() # y = 0

In [12]:
d

deque([1, 2])

Arrays

In Python, an array is a collection of elements of the same data type, which are stored in contiguous memory locations. 
unlike in other programming languages like C, arrays in Python are not a built-in data type. Instead

Python provides lists, tuples, and NumPy arrays to handle arrays.

#lists
A list can contain elements of different data types, and it's mutable, which means you can change its elements after it's created. Lists are created using square brackets [] or the list() function.

In [ ]:
my_list = [1, 2, 3, 4, 5]

In [26]:
my_list = ['apple', 'banana', 'orange']
print(my_list[0])
print(my_list[-1]) 
print(my_list[0:2])
print(len(my_list))

apple
orange
['apple', 'banana']
3

In [25]:
list1 = ['apple', 'banana']
list2 = ['orange', 'grape']

my_list = list1 + list2

print(my_list)

['apple', 'banana', 'orange', 'grape']

In [33]:
my_list = ['apple', 'banana', 'orange']

my_list.append('pear')
my_list.insert(4, 'wer')
my_list.remove('banana')
print('banana' in my_list)

for element in my_list:
    print(element)

print(my_list)

False
apple
orange
pear
wer
['apple', 'orange', 'pear', 'wer']

Tuples
Tuples are similar to lists, but they are immutable, which means you cannot change their elements once they are created. Tuples are created using parentheses () or the tuple() function.

In [14]:
my_tuple = (1, 2, 3, 4, 5)

In [22]:
my_tuple = ('apple', 'banana', 'orange')
print(my_tuple[0])
print(my_tuple[-1])
print(my_tuple[0:2]) 
print(len(my_tuple))
print('banana' in my_tuple)

apple
orange
('apple', 'banana')
3
True

In [23]:
for element in my_tuple:
    print(element)

apple
banana
orange

In [21]:
tuple1 = ('apple', 'banana')
tuple2 = ('orange', 'grape')

my_tuple = tuple1 + tuple2

print(my_tuple)

('apple', 'banana', 'orange', 'grape')

NumPy Arrays: NumPy is a powerful library for scientific computing in Python.
It provides a high-performance multidimensional array object, which is called ndarray.
NumPy arrays are homogeneous,
which means they can only contain elements of the same data type.

In [15]:
import numpy as np
my_array = np.array([1, 2, 3, 4, 5])

Sets:
a set is an unordered collection of unique elements.
Sets are useful when you want to store unique values and perform set operations such as union, intersection, and difference.

In [16]:
my_set = {1, 2, 3, 4, 5}
my_set = set([1, 2, 3, 4, 5])

Dictionaries:

a dictionary is a collection of key-value pairs, where each key is unique and mapped to a corresponding value. Dictionaries are useful when you want to store data that can be accessed quickly by a unique identifier.

In [17]:
my_dict = {'apple': 1, 'banana': 2, 'orange': 3}
my_dict = dict(apple=1, banana=2, orange=3)

In [36]:
print(my_dict['apple'])
print(my_dict.get('name')) 
my_dict['apple'] = 1
del my_dict['banana']

1
None

In [37]:
my_dict = {'name': 'John', 'age': 25, 'city': 'New York'}

if 'age' in my_dict:
    print('Age is present')
else:
    print('Age is not present')

Age is present

In [38]:
my_dict = {'name': 'John', 'age': 25, 'city': 'New York'}

for key, value in my_dict.items():
    print(key, value)

name John
age 25
city New York

In [ ]:

print(my_dict.get('name'))

In [ ]:
Strings

A string is a sequence of characters enclosed in either single quotes ('...') or double quotes ("..."). Strings are immutable,

In [18]:
my_string = 'Hello, world!'

my_list = my_string.split(',')

print(my_list)

['Hello', ' world!']

dataframe

In R, a dataframe is a two-dimensional data structure where the data is organized in rows and columns.

In [1]:
df <- data.frame(
  name = c("John", "Sarah", "Adam", "Lisa"),
  age = c(25, 30, 35, 40),
  gender = c("Male", "Female", "Male", "Female"),
  salary = c(50000, 60000, 70000, 80000)
)

Subsetting:You can subset a dataframe to extract a subset of rows or columns based on specific criteria.
df[row,colloumn]

In [14]:
df[1:2, ];df[1:2,1] ;df[1:4,1] ;df[1:4,];df[ ,c("name","gender")]

  name  age gender salary
1 John  25  Male   50000
2 Sarah 30  Female 60000

[1] "John"  "Sarah"

[1] "John"  "Sarah" "Adam"  "Lisa"

  name  age gender salary
1 John  25  Male   50000
2 Sarah 30  Female 60000
3 Adam  35  Male   70000
4 Lisa  40  Female 80000

  name  gender
1 John  Male
2 Sarah Female
3 Adam  Male
4 Lisa  Female

Filtering: You can filter a dataframe to extract rows based on specific conditions

In [15]:
subset(df, age > 30)

  name age gender salary
3 Adam 35  Male   70000
4 Lisa 40  Female 80000

Sorting:You can sort a dataframe based on specific column(s) using the order() function

In [16]:
df[order(df$age), ]

  name  age gender salary
1 John  25  Male   50000
2 Sarah 30  Female 60000
3 Adam  35  Male   70000
4 Lisa  40  Female 80000

Aggregating:The aggregate() function can be used to group data based on specific column(s) and apply the aggregation function(s).

In [19]:
aggregate(salary ~ gender, data = df, max)

  gender salary
1 Female 80000
2 Male   70000

In [ ]:
Reshaping: You can reshape a dataframe from wide to long format or vice versa using the

In [20]:
idyr::gather(df, key = "variable", value = "value", -name)

ERROR: Error in loadNamespace(x): there is no package called 'idyr'

Machine learning

In [21]:
data(mtcars)

In [22]:
mtcars$mpg_high <- ifelse(mtcars$mpg > 20, 1, 0)

In [24]:
mtcars

                    mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Mazda RX4           21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag       21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
Datsun 710          22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive      21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout   18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2
Valiant             18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
Duster 360          14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4
Merc 240D           24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
Merc 230            22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
Merc 280            19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4
Merc 280C           17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4
Merc 450SE          16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3
Merc 450SL          17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3
Merc 450SLC         15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3
Cadillac Fleetwood  10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4
Lincoln Continental 10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4
Chrysler Imperial   14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4
Fiat 128            32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
Honda Civic         30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
Toyota Corolla      33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
Toyota Corona       21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
Dodge Challenger    15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2
AMC Javelin         15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2
Camaro Z28          13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4
Pontiac Firebird    19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2
Fiat X1-9           27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
Porsche 914-2       26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
Lotus Europa        30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
Ford Pantera L      15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4
Ferrari Dino        19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6
Maserati Bora       15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8
Volvo 142E          21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2
                    mpg_high
Mazda RX4           1
Mazda RX4 Wag       1
Datsun 710          1
Hornet 4 Drive      1
Hornet Sportabout   0
Valiant             0
Duster 360          0
Merc 240D           1
Merc 230            1
Merc 280            0
Merc 280C           0
Merc 450SE          0
Merc 450SL          0
Merc 450SLC         0
Cadillac Fleetwood  0
Lincoln Continental 0
Chrysler Imperial   0
Fiat 128            1
Honda Civic         1
Toyota Corolla      1
Toyota Corona       1
Dodge Challenger    0
AMC Javelin         0
Camaro Z28          0
Pontiac Firebird    0
Fiat X1-9           1
Porsche 914-2       1
Lotus Europa        1
Ford Pantera L      0
Ferrari Dino        0
Maserati Bora       0
Volvo 142E          1

In [26]:
library(caret)

Loading required package: ggplot2

Loading required package: lattice

Split the data: We'll split the data into a training set (80% of the data) and a testing set (20% of the data).

In [27]:
set.seed(123)
train_index <- createDataPartition(mtcars$mpg_high, p = 0.8, list = FALSE)
train_data <- mtcars[train_index, ]
test_data <- mtcars[-train_index, ]

Train the model: We'll use logistic regression to train the model on the training set. We'll use the glm() function to fit a logistic regression model to the data.

In [28]:
model <- glm(mpg_high ~ hp + cyl, data = train_data, family = "binomial")

Warning message:
"glm.fit: algorithm did not converge"
Warning message:
"glm.fit: fitted probabilities numerically 0 or 1 occurred"

In [30]:
predictions <- predict(model, newdata = test_data, type = "response")

In [33]:
test_data$mpg_high <- factor(train_data$mpg_high, levels = levels(test_data$mpg_high))

ERROR: Error in `$<-.data.frame`(`*tmp*`, mpg_high, value = structure(c(NA_integer_, : replacement has 26 rows, data has 6

In [31]:
confusionMatrix(predictions > 0.5, test_data$mpg_high)

ERROR: Error: `data` and `reference` should be factors with the same levels.